#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#1. Сформувати функцію, що буде обчислювати факторіал заданого користувачем
#натурального числа n.
from time import time

n = int(input())

def factorial(n):
    if n == 0:
        return 1
    else:
        return n * factorial(n - 1)

start = time()
print(factorial(n))
stop = time()
print('Затрачений час: ', stop - start)
#складність алгоритму O(n)
#читабельність коду: на мою думку, рекурсивний варіант
#тяжче зрозуміти, чим ітераційний, бо в рекурсії треба розбиратись, щоб її розуміти.
