#Виконав: Лавренюк Б.В., 1 курс, 122Г, ФТФ
#2. Сформувати функцію для обчислення цифрового кореню натурального числа.
#Цифровий корінь отримується наступним чином: необхідно скласти всі цифри заданого
#числа, потім скласти всі цифри знайденої суми і повторювати процес до тих пір, поки
#сума не буде дорівнювати однозначному числу, що і буде цифровим коренем заданого
#числа.
from time import time

q = int(input())

def d_r(q):
    if q == 0:
        return 0
    if q % 9 == 0 and q != 0:
        return 9
    return q % 9

start = time()
print(d_r(q))
stop = time()
print('Затрачений час: ', stop - start)
#не впевнений, але наверно тут теж складність алгоритму O(n)
#на мою думку, цей код більш складніший для розуміння за рекурсивний метод вирішення цієї ж задачі
